mirai-delete-yourself.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-12 Thu 04:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mirai Delete yourself</title>
<meta name="author" content="Wade Mealing" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<nav style="margin-bottom: 40px; font-family: sans-serif; margin-top: 0;">
    <div style="display: flex; justify-content: space-between; align-items: center; margin-bottom: 10px; margin-top: 0;">
        <span style="font-size: 1.2rem; font-weight: bold; color: #333; margin-top: 0;">Wade Mealing</span>
        <a href="/index.html" style="text-decoration: none; color: #01579b; font-weight: bold; border: 1px solid #01579b; padding: 4px 12px; border-radius: 4px; font-size: 0.9rem; margin-top: 0;">Home</a>
    </div>
    <hr style="border: 0; border-top: 1px solid #eee; margin: 20px 0; margin-top: 0;">

    <div style="display: flex; flex-wrap: wrap; gap: 20px; justify-content: space-between; margin-top: 0;">

        <div style="flex: 1; min-width: 250px; margin-top: 0;">
            <h3 style="margin-bottom: 10px; margin-top: 0; font-size: 1.1rem; color: #333; text-transform: uppercase;">Systems & Distributed Programming</h3>
            <div style="display: flex; flex-wrap: wrap; gap: 8px; margin-top: 0;">
                <span style="display: inline-block; background: #e1f5fe; color: #01579b; padding: 4px 10px; border-radius: 4px; font-size: 0.85rem; font-weight: bold; margin-top: 0;">Erlang/OTP</span>
                <span style="display: inline-block; background: #e1f5fe; color: #01579b; padding: 4px 10px; border-radius: 4px; font-size: 0.85rem; font-weight: bold; margin-top: 0;">Clojure</span>
                <span style="display: inline-block; background: #e1f5fe; color: #01579b; padding: 4px 10px; border-radius: 4px; font-size: 0.85rem; font-weight: bold; margin-top: 0;">Lisp Flavored Erlang</span>
                <span style="display: inline-block; background: #e8f5e9; color: #1b5e20; padding: 4px 10px; border-radius: 4px; font-size: 0.85rem; font-weight: bold; margin-top: 0;">Cellium (TUI Framework)</span>
            </div>
        </div>

        <div style="flex: 1; min-width: 250px; margin-top: 0;">
            <h3 style="margin-bottom: 10px; margin-top: 0; font-size: 1.1rem; color: #333; text-transform: uppercase;">Security & Kernel Research</h3>
            <div style="display: flex; flex-wrap: wrap; gap: 8px; margin-top: 0;">
                <span style="display: inline-block; background: #fff3e0; color: #e65100; padding: 4px 10px; border-radius: 4px; font-size: 0.85rem; font-weight: bold; margin-top: 0;">Linux Kernel Analysis</span>
                <span style="display: inline-block; background: #fff3e0; color: #e65100; padding: 4px 10px; border-radius: 4px; font-size: 0.85rem; font-weight: bold; margin-top: 0;">eBPF</span>
                <span style="display: inline-block; background: #fff3e0; color: #e65100; padding: 4px 10px; border-radius: 4px; font-size: 0.85rem; font-weight: bold; margin-top: 0;">Malware Reversing</span>
                <span style="display: inline-block; background: #fff3e0; color: #e65100; padding: 4px 10px; border-radius: 4px; font-size: 0.85rem; font-weight: bold; margin-top: 0;">Rust</span>
            </div>
        </div>

        <div style="flex: 1; min-width: 250px; margin-top: 0;">
            <h3 style="margin-bottom: 10px; margin-top: 0; font-size: 1.1rem; color: #333; text-transform: uppercase;">Tooling & Workflow</h3>
            <div style="display: flex; flex-wrap: wrap; gap: 8px; margin-top: 0;">
                <span style="display: inline-block; background: #f3e5f5; color: #4a148c; padding: 4px 10px; border-radius: 4px; font-size: 0.85rem; font-weight: bold; margin-top: 0;">Emacs / Elisp</span>
                <span style="display: inline-block; background: #f3e5f5; color: #4a148c; padding: 4px 10px; border-radius: 4px; font-size: 0.85rem; font-weight: bold; margin-top: 0;">CI/CD Pipelines</span>
                <span style="display: inline-block; background: #f3e5f5; color: #4a148c; padding: 4px 10px; border-radius: 4px; font-size: 0.85rem; font-weight: bold; margin-top: 0;">OpenSCAD</span>
            </div>
        </div>

    </div>
    <hr style="border: 0; border-top: 1px solid #eee; margin: 20px 0; margin-top: 0;">
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Mirai Delete yourself</h1>
<nav class="navbar-custom">
    <div class="navbar-grid">

        <div class="navbar-section">
            <a href="systems.html" style="text-decoration: none;"><h3>Systems & Distributed Programming</h3></a>
            <div class="navbar-tags">
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Erlang/OTP</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Clojure</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Lisp Flavored Erlang</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag special">Cellium (TUI Framework)</span></a>
            </div>
        </div>

        <div class="navbar-section">
            <a href="security.html" style="text-decoration: none;"><h3>Security & Kernel Research</h3></a>
            <div class="navbar-tags">
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Linux Kernel Analysis</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">eBPF</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Malware Reversing</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Rust</span></a>
            </div>
        </div>

        <div class="navbar-section">
            <a href="tooling.html" style="text-decoration: none;"><h3>Tooling & Workflow</h3></a>
            <div class="navbar-tags">
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">Emacs / Elisp</span></a>
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">CI/CD Pipelines</span></a>
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">OpenSCAD</span></a>
            </div>
        </div>

    </div>
</nav>
<div id="outline-container-org024f1cb" class="outline-2">
<h2 id="org024f1cb">Why delete the executable ?</h2>
<div class="outline-text-2" id="text-org024f1cb">
<p>
The Mirai malware uses a technique to remove itself from disk after
executing has started.  This adds additional complexity of
attempting to fingerprint the malware by reducing the footprint of
evidence of the attack taking place.
</p>

<p>
Deleting the executable file during run time does not make it
impossible to recover the file, however it does add additionalx
complexity while trying to analyse it in action.
</p>
</div>
</div>
<div id="outline-container-orgf8063fc" class="outline-2">
<h2 id="orgf8063fc">Recovering an executable file.</h2>
<div class="outline-text-2" id="text-orgf8063fc">
<p>
The /proc filesystem will maintain a link to all files opened by an
executing process even if the file has been removed from disk.
</p>

<p>
Each processes open files can be read from /proc/&lt;numeric-pid&gt;/exe
</p>
<pre class="example" id="org87a4c2b">
$ sudo ls -l /proc/975301/exe
lrwxrwxrwx. 1 root root 0 Nov  8 22:50 /proc/975301/exe -&gt; /tmp/.malware/init
</pre>

<p>
This is a regular file, and with root user permissions, the file can
be copied for later inspection.
</p>

<pre class="example" id="orga9638b2">
$ cat /proc/975301/exec &gt;&gt; ~/captured-executable
</pre>

<p>
If the malware is a scripting language (Mirai is not), the actual
executable script will be available in another location in the
`/proc/&lt;some-pid&gt;/fd/
</p>

<pre class="example" id="org01948c3">
$ sudo ls -l /proc/975301/fd/
 total 0
 lr-x------. 1 root root 64 Nov 10 01:08 0 -&gt; /dev/null
 lrwx------. 1 root root 64 Nov 10 01:08 1 -&gt; 'socket:[38592]'
 l-wx------. 1 root root 64 Nov 10 01:08 10 -&gt; /tmp/.malware/script.py
</pre>
</div>
</div>
<div id="outline-container-org6f52fef" class="outline-2">
<h2 id="org6f52fef">The sample code.</h2>
<div class="outline-text-2" id="text-org6f52fef">
<p>
Mirai's self deletion code is simple and unerror checked.
</p>

<pre class="example" id="org3823fa5">
// Delete self
unlink(args[0]);
</pre>

<p>
See <a href="https://github.com/wmealing/Mirai-Source-Code/blob/master/mirai/bot/main.c#L61">it in action here</a>.
</p>

<p>
The <a href="https://linux.die.net/man/2/unlink">unlink</a> function deletes a file by name from the file system.  It
has a number of possible error conditions, but it appears that the
author did not care about any of them.
</p>
</div>
</div>
<div id="outline-container-org26c7af0" class="outline-2">
<h2 id="org26c7af0">Porting to rust.</h2>
<div class="outline-text-2" id="text-org26c7af0">
<p>
To implement the same functionality in rust we first need to get the
current processes executable file path.
</p>

<p>
Much like all languages, it is the first arguement in the processes
args array.
</p>

<p>
Once we have the program path, it ss a simple matter of using
rusts std::fs remove_file function to delete the file.
</p>

<p>
The process will continue to run normally and the file will be
removed from disk during execution, and the process will continue
to run.
</p>

<pre class="example" id="org5e05e93">
use std::fs;

 fn main() {
   //// Delete the executing file to remove incriminating evidence
   let argv0 = std::env::args().next().unwrap(); // this will always exist.
   let _result = delete_file(&amp;argv0);
 }

 fn delete_file(filename: &amp;str) -&gt; std::result::Result&lt;(), std::io::Error&gt; {
  info!("Deleting binary!");
  fs::remove_file(filename)?;
  Ok(())
 }
</pre>

<p>
Having the executable 'missing' would be one of the big alarm bells
for an intrustion detection system.
</p>

<p>
Perhaps a better option to make this harder to detect would be to
move a legit binary, rename the malware to the exeutable in place
delete the malware then put the original executable back.
</p>

<p>
This would be much harder to detect, especially if it communicated
using the same ports and had the same process name.
</p>

<p>
I believe this would be similar to <a href="https://github.com/jxy-s/herpaderping">herpaderping</a> on windows.
</p>
</div>
</div>
<div id="outline-container-orgff5cd23" class="outline-2">
<h2 id="orgff5cd23">Resources:</h2>
<div class="outline-text-2" id="text-orgff5cd23">
<ul class="org-ul">
<li><a href="https://github.com/wmealing/Mirai-Source-Code">Mirai source code</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Wade Mealing</p>
<p class="date">Created: 2026-03-12 Thu 04:14</p>
</div>
</body>
</html>
